In [1]:
import numpy
import matplotlib.pyplot as plt
import pandas
from numpy import random
import math

In [22]:
data=pandas.read_csv("C:\Machine_learning_lab\\hiringfile.csv")

In [23]:
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                      8                           9      50000
1       zero                      8                           6      45000
2       five                      6                           7      60000
3        two                     10                          10      65000
4      seven                      9                           6      70000
5      three                      7                          10      62000
6        ten                      0                           7      72000
7     eleven                      7                           8      80000

In [24]:
experience={'zero':0,'five':5,'two':2,'seven':7,'three':3,'ten':10,'eleven':11}

In [25]:
data.experience=[experience[item] for item in data.experience]

In [26]:
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                      8                           9      50000
1           0                      8                           6      45000
2           5                      6                           7      60000
3           2                     10                          10      65000
4           7                      9                           6      70000
5           3                      7                          10      62000
6          10                      0                           7      72000
7          11                      7                           8      80000

In [27]:
experience=[]
for i in range(len(data['experience'])):
    experience.append(data['experience'][i])
experience=numpy.array(experience)


test_score=[]
for i in range(len(data['test_score(out of 10)'])):
    test_score.append(data['test_score(out of 10)'][i])
test_score=numpy.array(test_score)


interview_score=[]
for i in range(len(data['interview_score(out of 10)'])):
    interview_score.append(data['interview_score(out of 10)'][i])
interview_score=numpy.array(interview_score)


salary=[]
for i in range(len(data['salary($)'])):
    salary.append(data['salary($)'][i])
salary=numpy.array(salary)

In [28]:
x1=[]

for i in range(len(data['experience'])):
    x1.append([data['experience'][i],data['test_score(out of 10)'][i],data['interview_score(out of 10)'][i],1])
    
x1=numpy.array(x1)

In [35]:
A_plus=numpy.linalg.pinv(x1)
#print(A_plus)

In [30]:
coefs = A_plus.dot(salary)
print(coefs)

[ 3077.8642085    999.7856246   2118.48834717 24823.52310661]

In [32]:
salary1=coefs[0]*4+coefs[1]*8+coefs[2]*8+coefs[3]
print("The salary for experience = four, test score = 8 and interview score = 8",salary1)

62081.17171469699

In [33]:
salary2=coefs[0]*4+coefs[1]*8+coefs[2]*5+coefs[3]
print("The salary for experience = four, test score = 8 and interview score = 5",salary2)

55725.70667320004

In [34]:
salary3=coefs[0]*4+coefs[1]*5+coefs[2]*8+coefs[3]
print("The salary for experience = four, test score = 5 and interview score = 8",salary3)

59081.81484090284